ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/8A4R-SU/pins_arduino.h
/*******************************************************************************
 *  pins_arduino.h  -  MPINO-8A4R-SU
 *  -----------------------------------------------------------------------------
 *  Industrial Arduino-compatible PLC board by ILOGICS Co., Ltd.
 *  (산업용 아두이노 호환 PLC 보드  /  주식회사 아이로직스)
 *
 *  MCU        : ATmega128-AU (64-pin TQFP)
 *  Crystal    : 16 MHz (Arduino IDE compatibility)
 *  Toolchain  : MegaCore  ->  https://github.com/MCUdude/MegaCore
 *
 *  Board hardware features:
 *      - 8x Digital  Inputs   (P0..P7)        photo-coupler isolated, 5..24 V
 *      - 4x Relay    Outputs  (P32..P35)      max  AC 250V / DC 30V , 16A
 *      - 4x Analog   Inputs   (A0..A3)        jumper: 0-5V / 0-20mA / 4-20mA
 *      - 2x Temp     Inputs   (A4, A5)        NTC 10k 3950, -40..120 °C
 *      - 6x PWM      Outputs  (D21-23, D26-28)
 *      - 1x I2C bus           (D18 / D19, on-board 10k pull-ups)
 *      - 1x SPI bus           (D8..D11)
 *      - 1x RS-485 (Serial1)  (Modbus RTU master/slave)
 *      - Power : DC 24 V  (relays require 24 V)
 *
 *  Verified against:
 *      - MPINO-8A4R-SU schematic (Rev. 2025-07-25)
 *      - MPINO-8A4R-SU 사용설명서 (Arduino IDE edition)
 *
 *  -----------------------------------------------------------------------------
 *  Quick pin reference (silk name  ->  Arduino digital number  ->  MCU pin)
 *  -----------------------------------------------------------------------------
 *      Digital Inputs            (photo-coupler, NPN or PNP)
 *          D0 .. D7              ->  PA0..PA7
 *
 *      Relay Outputs             (R32..R35  /  RL1..RL4)
 *          D32 .. D35            ->  PC0..PC3
 *
 *      Analog Inputs
 *          A0  = D45  (PF0)      user analog input (0-5V / 0-20mA / 0-10V)
 *          A1  = D46  (PF1)      "
 *          A2  = D47  (PF2)      "
 *          A3  = D48  (PF3)      "
 *          A4  = D49  (PF4)      on-board NTC #1
 *          A5  = D50  (PF5)      on-board NTC #2
 *
 *      PWM Outputs               (use analogWrite())
 *          D21 (PE3)             Timer3 channel A   - PWM header pin
 *          D22 (PE4)             Timer3 channel B
 *          D23 (PE5)             Timer3 channel C
 *          D26 (PB5)             Timer1 channel A   - PWM header pin
 *          D27 (PB6)             Timer1 channel B
 *          D28 (PB7)             Timer1 channel C
 *
 *      External Interrupts       (attachInterrupt with digitalPinToInterrupt())
 *          D18 (PD0)  INT0       SCL  (10k pull-up on-board)
 *          D19 (PD1)  INT1       SDA  (10k pull-up on-board)
 *          D22 (PE4)  INT4       shared with PWM (Timer3 B)
 *          D23 (PE5)  INT5       shared with PWM (Timer3 C)
 *          D24 (PE6)  INT6       CLK  (also FND CLK / encoder A)
 *          D25 (PE7)  INT7       DIO  (also FND DIO / encoder B)
 *
 *      Communication
 *          D16 (PE0) / D17 (PE1)         Serial   - USB download (9600 default)
 *          D29 (PD3) / RS-485 driver     Serial1  - RS-485 (Modbus RTU)
 *          D18 (PD0) / D19 (PD1)         I2C      - SCL / SDA
 *          D8  (PB0) / D9  (PB1) /
 *          D10 (PB2) / D11 (PB3)         SPI      - SS / SCK / MOSI / MISO
 *
 *      Status LED
 *          D20 (PE2)                     LED_BUILTIN / STATUS
 *
 *  -----------------------------------------------------------------------------
 *  IMPORTANT - shared resources (read this before wiring your sketch):
 *  -----------------------------------------------------------------------------
 *      1) PWM aliasing:
 *         D26, D27, D28 share the SAME physical pins as D13, D14, D15
 *         (all are PB5 / PB6 / PB7).  For PWM use D26-D28 only; for plain
 *         GPIO use D13-D15.  Never drive the same pin from both numbers
 *         at the same time.
 *
 *      2) FND / encoder vs. interrupt:
 *         The FND (7-segment) and encoder headers occupy D24 (CLK) and
 *         D25 (DIO).  If you call attachInterrupt() on D24 or D25,
 *         the FND / encoder accessory cannot be used at the same time.
 *
 *      3) I2C vs. interrupt:
 *         D18 and D19 are the I2C SCL / SDA lines (with on-board 10k
 *         pull-ups).  If you use them as INT0 / INT1, the I2C bus is
 *         no longer available.
 *
 *      4) PWM vs. interrupt (D22 / D23):
 *         D22 (PE4) and D23 (PE5) are wired to both Timer3 PWM channels
 *         AND ATmega128 external interrupt sources INT4 / INT5.
 *         Each pin can be used for ONE of the two roles at a time -
 *         either as analogWrite() output, or as attachInterrupt() input.
 *
 *      5) Reserved pins:
 *         - PD2 is consumed by the RS-485 transceiver (Serial1 RX1) and
 *           is intentionally NOT exposed as a numbered Arduino pin.
 *         - D12 (PB4 / OC0) has hardware PWM capability but Timer0 is
 *           used by the Arduino core for millis() / delay(), so D12 is
 *           NOT advertised as a PWM pin here.
 *
 *      6) USB power vs. 24 V power:
 *         When the board runs on USB 5 V only, the relays will NOT
 *         actuate (relay coils require 24 V).  Analog inputs are also
 *         less stable on USB power.
 *
 *  Copyright (c) ILOGICS Co., Ltd.   https://www.ilogics.co.kr
 *  Tech support : 0507-1362-5020
 ******************************************************************************/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

/* ===== Board / core identification ====================================== */
#define MEGACORE
#define MCUDUDE_MEGACORE
#define MPINO128
#define MEGACORE_64_PIN_AVR_PINOUT

/* ===== FND / encoder accessory pins ===================================== */
/* On-board 4-pin header for FND or rotary encoder.                         */
/* CLK = D24 = PE6 = INT6   ,   DIO = D25 = PE7 = INT7                      */
#define CLK 24
#define DIO 25

/* ===== Pin count ======================================================== */
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__) || defined(__AVR_AT90CAN32__) \
|| defined(__AVR_AT90CAN64__) || defined(__AVR_AT90CAN128__)
#define NUM_DIGITAL_PINS           (53)
#elif defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
#define NUM_DIGITAL_PINS           (54)
#endif

